use tasq;
#set names cp1251;

DROP TABLE IF EXISTS tasq_ictype;
CREATE TABLE tasq_ictype (
	id				INTEGER UNSIGNED NOT NULL AUTO_INCREMENT,
	date_updated	TIMESTAMP(14),
	date_created	TIMESTAMP(14),
	date_published	TIMESTAMP(14),
	published		TINYINT UNSIGNED NOT NULL DEFAULT 0,
	deleted			TINYINT UNSIGNED NOT NULL DEFAULT 0,
	manorder		INTEGER UNSIGNED NOT NULL DEFAULT 0,
	ident			VARCHAR(250) NOT NULL DEFAULT '',

	hashkey			VARCHAR(250) NOT NULL DEFAULT '',

	PRIMARY KEY(id)
);

#desc tasq_ictype;
#insert into tasq_ictype(id, ident) values(1, 'NONE');

INSERT INTO tasq_ictype (id, date_updated, date_created, date_published, published, deleted, manorder, ident, hashkey) VALUES
	(1,'2004-03-01 16:55:38','2004-02-26 20:30:57','2004-02-26 20:30:57',1,0,2,'текстовое поле','TEXTFIELD'),
	(2,'2004-03-01 16:55:30','2004-02-26 20:31:56','2004-02-26 20:31:56',1,0,3,'числовое поле','NUMBER'),
	(7,'2004-03-01 16:55:05','2004-02-26 21:46:14','2004-02-26 21:46:14',1,0,8,'дата и время','DATETIME'),
	(3,'2004-03-01 16:55:22','2004-02-26 20:32:08','2004-02-26 20:32:08',1,0,5,'чекбокс','CHECKBOX'),
	(4,'2004-03-02 21:07:08','2004-02-26 20:32:17','2004-02-26 20:32:17',1,0,11,'выбор из справочника','ICSELECT'),
	(5,'2004-03-01 16:55:15','2004-02-26 20:32:53','2004-02-26 20:32:53',1,0,6,'да / нет / не знаю','TRISTATE'),
	(6,'2004-03-01 16:55:08','2004-02-26 21:46:08','2004-02-26 21:46:08',1,0,7,'дата','DATE'),
	(8,'2004-03-02 13:53:35','2004-02-26 23:06:05','2004-02-26 23:06:05',1,0,9,'файл','UPLOAD'),
	(9,'2004-03-23 14:49:15','2004-02-26 23:06:20','2004-02-26 23:06:20',1,0,10,'картинка','ICIMAGE'),
	(11,'2004-03-02 21:03:45','2004-03-02 16:31:12','2004-03-02 16:31:12',1,0,13,'множественный выбор из справочника (multi#select)','ICMULTISELECT'),
	(10,'2004-03-01 16:55:53','2004-03-01 16:55:42','2004-03-01 16:55:42',1,0,1,'текстовая область','TEXTAREA'),
	(12,'2004-03-30 17:28:12','2004-03-02 21:03:16','2004-03-02 21:03:16',1,0,14,'множественный выбор из справочника (multicheckbox)','ICMULTICHECKBOX'),
	(13,'2004-03-10 17:48:40','2004-03-03 16:48:40','2004-03-03 16:48:40',1,0,15,'строка по шаблону','AHREF'),
	(14,'2004-04-22 16:37:15','2004-04-22 16:36:14','2004-04-22 16:36:14',1,0,12,'мягкий выбор из справочника (неопубликованные - серым)','SELECT'),
	(15,'2005-03-04 16:39:00','2005-03-04 16:28:10','2005-03-04 16:28:10',1,0,4,'цена с эталоным диапазоном','NUMBER_ETHALON'),
	(16,'2007-07-30 00:08:57','2007-07-29 21:14:19','0000-00-00 00:00:00',1,0,16,'радиобаттоны из справочника','ICRADIO'),
	(17,'2007-09-08 23:29:41','2007-09-08 23:25:29','0000-00-00 00:00:00',1,0,17,'сырой HTML','RAWHTML'),
	(18,'2007-09-09 01:22:24','2007-09-09 01:22:24','0000-00-00 00:00:00',1,0,18,'textarea WxH','TEXTAREA_SCROLL');



#select * from tasq_ictype;

